Revit 2024 API
AnalyticalDirection Enumeration
 Specifies a direction for manipulating analytical model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum AnalyticalDirection
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")> _
Public Enumeration AnalyticalDirection
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum class AnalyticalDirection
Members
Member name | Description
Vertical |  Change in vertical direction only.
VerticalTop |  Vertical change, for top of Element's analytical model.
VerticalBottom |  Vertical change, for bottom of Element's analytical model.
Horizontal |  Change in horizontal direction only (no elevation change).
HorizontalStart |  Horizontal change, corresponding to start of Curve Driver.
HorizontalEnd |  Horizontal change, corresponding to end of Curve Driver.
Any |  Any change, including vertical and horizontal.
X |  Change in X direction
Y |  Change in Y direction
Z |  Change in Z direction
See Also
Autodesk.Revit.DB.Structure Namespace